Documents/Платежи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>Платежи</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.БалансДолжников</xr:Item>
				<xr:Item>AccumulationRegister.Платежи</xr:Item>
				<xr:Item>InformationRegister.ДанныеДоговоров</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Банк</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Банки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Должники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Должник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПлатежа</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтметкаФССП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>15</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ДанныеДоговоров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ДанныеДоговоров</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТекущийОсновнойДолг</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВсегоЗадолженность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПросроченныеПроценты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПросроченныйОсновнойДолг</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Неустойка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРасчетаЗадолженности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДнейПросрочки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекущиеПроценты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Госпошлина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Прочее</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерСтрокиТаблицы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/БалансДолжников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccumulationRegister>
		<Properties>
			<Name>БалансДолжников</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаДолга</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекущийОсновнойДолг</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПросроченныйОсновнойДолг</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекущиеПроценты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПросроченныеПроценты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Неустойка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Госпошлина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Прочее</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Должник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/Платежи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccumulationRegister>
		<Properties>
			<Name>Платежи</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Вознаграждение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтметкаФССП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Должник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПроцентВознаграждения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Реестр</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Реестр</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/Платежи/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	Перем Запрос;
	Отказ = ДоступностьИзмененийПоДатеЗапрета(Дата);
	// Получить данные для расчета
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	НачальныеДанныеДоговораСрезПоследних.ПроцентВознаграждения,
	//|	ПлатежиДолжники.НомерСтроки
	//|ИЗ
	//|	Документ.Платежи.Должники КАК ПлатежиДолжники
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НачальныеДанныеДоговора.СрезПоследних КАК НачальныеДанныеДоговораСрезПоследних
	//|		ПО ПлатежиДолжники.Договор = НачальныеДанныеДоговораСрезПоследних.Договор
	//|ГДЕ
	//|	ПлатежиДолжники.Ссылка = &ТекущийДокумент";
	//
	//Запрос.УстановитьПараметр("ТекущийДокумент", Ссылка); 
	//
	//тзПроцентыВознаграждения = Запрос.Выполнить().Выгрузить();
	//
	
	
	////{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	//// Данный фрагмент построен конструктором.
	//// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	//
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	ПлатежиДолжники.Ссылка КАК Ссылка,
	//	|	ПлатежиДолжники.НомерСтроки КАК НомерСтроки,
	//	|	ПлатежиДолжники.Должник КАК Должник,
	//	|	ПлатежиДолжники.Договор КАК Договор,
	//	|	ПлатежиДолжники.Сумма КАК Сумма,
	//	|	ПлатежиДолжники.ДатаПлатежа КАК ДатаПлатежа
	//	|ИЗ
	//	|	Документ.Платежи.Должники КАК ПлатежиДолжники
	//	|ГДЕ
	//	|	ПлатежиДолжники.Ссылка = &Ссылка
	//	|
	//	|УПОРЯДОЧИТЬ ПО
	//	|	НомерСтроки";
	//
	//Запрос.УстановитьПараметр("Ссылка", Ссылка);
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//
	//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//	// Вставить обработку выборки ВыборкаДетальныеЗаписи
	//КонецЦикла;
	//
	////}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА


	
	
	
    РегистрыСведений.ДанныеДоговоров.УстановитьИспользованиеИтогов(Ложь);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПлатежиДолжники.Ссылка КАК Ссылка,
		|	ПлатежиДолжники.НомерСтроки КАК НомерСтроки,
		|	ПлатежиДолжники.Должник КАК Должник,
		|	ПлатежиДолжники.Договор КАК Договор,
		|	ПлатежиДолжники.Сумма КАК Сумма,
		|	ПлатежиДолжники.ОтметкаФССП КАК ОтметкаФССП,
		|	ПлатежиДолжники.ДатаПлатежа КАК ДатаПлатежа
		|ИЗ
		|	Документ.Платежи.Должники КАК ПлатежиДолжники
		|ГДЕ
		|	ПлатежиДолжники.Ссылка = &Ссылка
	    |УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	 
	
	
	
	 ТаблицаДолжников = Запрос.Выполнить().Выгрузить();
	
	  кол=ТаблицаДолжников.Количество();
	  
	  
				   Если кол>500   Тогда
				   
					          старт=кол;
				              инд=0;
			  				  ост= кол%500;
							  
							  
							  Движения.ДанныеДоговоров.Очистить();
							  
							  
						  	  Пока (кол-ост)>0 Цикл
								 
								    Для Счетчик = инд По инд+499 Цикл
										
										
										
										        стрДолж=ТаблицаДолжников[Счетчик];
																				  
																				 
											    Если стрДолж.ДатаПлатежа = '00010101' Тогда
													ДатаПлатежа	= Дата;
												Иначе
													ДатаПлатежа	= стрДолж.ДатаПлатежа;
												КонецЕсли; 
												Ответственный 	= Привязка.ПолучитьОтветственного(стрДолж.Должник, НачалоДня(ДатаПлатежа));
												Сотрудник 		= Привязка.ПолучитьСотрудникаАктивного(стрДолж.Должник, НачалоДня(ДатаПлатежа));
												
												//НайденнаяСтрока = тзПроцентыВознаграждения.Найти(стрДолж.НомерСтроки, "НомерСтроки");
												//Если НайденнаяСтрока = Неопределено Тогда
												//    Сообщить("Процент вознаграждения = 0. Реестром не загружены данные по договору: " + Строка(стрДолж.Договор), СтатусСообщения.Внимание);
												//	ПроцентВознаграждения = 0;
												//Иначе
												//    ПроцентВознаграждения = НайденнаяСтрока.ПроцентВознаграждения;
												//КонецЕсли;
												
												Банк = стрДолж.Договор.Банк;
												Если Банк.ПорядокПогашенияЗадолженности.Количество() > 0 Тогда
													// списывать задолженность только если указан порядок ее списания
													// регистр БалансДолжников Приход
													ДвижениеБД = Движения.БалансДолжников.Добавить();
													ДвижениеБД.ВидДвижения 	= ВидДвиженияНакопления.Расход;
													ДвижениеБД.Период 		= ДатаПлатежа;
													ДвижениеБД.Должник 		= стрДолж.Должник;
													ДвижениеБД.Договор 		= стрДолж.Договор;
													ДвижениеБД.Сумма		= стрДолж.Сумма;
													ДвижениеБД.Описание		= "Поступил платёж";
													
													ДвДанныеДоговоров = Движения.ДанныеДоговоров.Добавить();
													ДвДанныеДоговоров.Период 					= ДатаПлатежа;
													ДвДанныеДоговоров.ДатаРасчетаЗадолженности	= ДатаПлатежа;
													ДвДанныеДоговоров.Договор = стрДолж.Договор;
													
													ДвДанныеДоговоров.НомерСтрокиТаблицы= стрДолж.НомерСтроки;
													
													
													
													//sza171128-1035 Широков_Игорь: списать долги по очереди 
													СтруктураОтбора = Новый Структура("Договор", стрДолж.Договор);
													ТаблицаДолгаПоДоговору = РегистрыСведений.ДанныеДоговоров.СрезПоследних(ДатаПлатежа, СтруктураОтбора);
													СуммаПлатежа = стрДолж.Сумма;
													ОстатокСуммы = СуммаПлатежа;
													
													ТаблицаДолгаПоДоговору.Сортировать("Период УБЫВ,НомерСтрокиТаблицы УБЫВ");

													Если ТаблицаДолгаПоДоговору.Количество() > 0 Тогда // есть Структура долга 
														СтрокаДолга = ТаблицаДолгаПоДоговору.Получить(0);
														СуммаДолга = 0;
														ДвДанныеДоговоров.ВсегоЗадолженность = СтрокаДолга.ВсегоЗадолженность - стрДолж.Сумма;
														Для каждого строкаОчередности Из Банк.ПорядокПогашенияЗадолженности Цикл
															Задолженность = строкаОчередности.Задолженность;
															СуммаЗадолженности = СтрокаДолга[строкаОчередности.Задолженность];
															СуммаПогашения = ?(СуммаЗадолженности <= ОстатокСуммы, СуммаЗадолженности, ОстатокСуммы);
															ДвижениеБД[Задолженность] = СуммаПогашения;
															ДвДанныеДоговоров[Задолженность] = СуммаЗадолженности - СуммаПогашения;
															ОстатокСуммы = ОстатокСуммы - СуммаПогашения;
														КонецЦикла;
														Если ОстатокСуммы > 0 Тогда
															Сообщить("У "+ стрДолж.Должник + " сумма платежа больше задолженности");
														КонецЕсли;
													Иначе
														ДвижениеБД.ПросроченныйОсновнойДолг = СуммаПлатежа;
													КонецЕсли;
													
																										
													Движения.ДанныеДоговоров.Записать(Ложь);//sza171128-1035 Широков_Игорь: списать долги по очереди
													

												КонецЕсли;
												
												
												// регистр Платежи 
												РеестрДолжника = ПолучитьРеестрДолжника(ДатаПлатежа,стрДолж.Должник, стрДолж.Договор);
												
												Движение = Движения.Платежи.Добавить();
												ЗаполнитьЗначенияСвойств(Движение, стрДолж);
												
												Движение.Период 				= ДатаПлатежа;
												Движение.Ответственный 			= Сотрудник;
												Движение.Количество				= 1;
												//Движение.Вознаграждение 		= стрДолж.Сумма * ?(ПроцентВознаграждения = Null,0,ПроцентВознаграждения) / 100;
												//Движение.ПроцентВознаграждения 	= ПроцентВознаграждения;  
												Движение.Сотрудник 				= Сотрудник;
												Движение.Реестр 				= РеестрДолжника;// +Крылов 2011.03.05
												
												Движение.ОтметкаФССП=стрДолж.ОтметкаФССП;
												
												

																			 
										 
									  
								    КонецЦикла;	
								  
								  инд=инд+500;
						  		  
								  
								  кол=кол-500;
								  
								  
							  
							  КонецЦикла;
							  
							  
							  Если старт> инд Тогда
								  
								  
							        Для Счетчик = инд По старт-1 Цикл
							    	  
							    	  стрДолж=ТаблицаДолжников[Счетчик];
							    	  
							    	       стрДолж=ТаблицаДолжников[Счетчик];
							    												  
							    												 
							    			    Если стрДолж.ДатаПлатежа = '00010101' Тогда
							    					ДатаПлатежа	= Дата;
							    				Иначе
							    					ДатаПлатежа	= стрДолж.ДатаПлатежа;
							    				КонецЕсли; 
							    				Ответственный 	= Привязка.ПолучитьОтветственного(стрДолж.Должник, НачалоДня(ДатаПлатежа));
							    				Сотрудник 		= Привязка.ПолучитьСотрудникаАктивного(стрДолж.Должник, НачалоДня(ДатаПлатежа));
							    				
							    				//НайденнаяСтрока = тзПроцентыВознаграждения.Найти(стрДолж.НомерСтроки, "НомерСтроки");
							    				//Если НайденнаяСтрока = Неопределено Тогда
							    				//    Сообщить("Процент вознаграждения = 0. Реестром не загружены данные по договору: " + Строка(стрДолж.Договор), СтатусСообщения.Внимание);
							    				//	ПроцентВознаграждения = 0;
							    				//Иначе
							    				//    ПроцентВознаграждения = НайденнаяСтрока.ПроцентВознаграждения;
							    				//КонецЕсли;
							    				
							    				Банк = стрДолж.Договор.Банк;
							    				Если Банк.ПорядокПогашенияЗадолженности.Количество() > 0 Тогда
							    					// списывать задолженность только если указан порядок ее списания
							    					// регистр БалансДолжников Приход
							    					ДвижениеБД = Движения.БалансДолжников.Добавить();
							    					ДвижениеБД.ВидДвижения 	= ВидДвиженияНакопления.Расход;
							    					ДвижениеБД.Период 		= ДатаПлатежа;
							    					ДвижениеБД.Должник 		= стрДолж.Должник;
							    					ДвижениеБД.Договор 		= стрДолж.Договор;
							    					ДвижениеБД.Сумма		= стрДолж.Сумма;
							    					ДвижениеБД.Описание		= "Поступил платёж";
													
													
							    					ДвДанныеДоговоров = Движения.ДанныеДоговоров.Добавить();
							    					ДвДанныеДоговоров.Период 					= ДатаПлатежа;
							    					ДвДанныеДоговоров.ДатаРасчетаЗадолженности	= ДатаПлатежа;
							    					ДвДанныеДоговоров.Договор = стрДолж.Договор;
													ДвДанныеДоговоров.НомерСтрокиТаблицы= стрДолж.НомерСтроки;
							    					//sza171128-1035 Широков_Игорь: списать долги по очереди 
							    					СтруктураОтбора = Новый Структура("Договор", стрДолж.Договор);
							    					ТаблицаДолгаПоДоговору = РегистрыСведений.ДанныеДоговоров.СрезПоследних(ДатаПлатежа, СтруктураОтбора);
							    					СуммаПлатежа = стрДолж.Сумма;
							    					ОстатокСуммы = СуммаПлатежа;
													
													ТаблицаДолгаПоДоговору.Сортировать("Период УБЫВ,НомерСтрокиТаблицы УБЫВ");

							    					Если ТаблицаДолгаПоДоговору.Количество() > 0 Тогда // есть Структура долга 
							    						СтрокаДолга = ТаблицаДолгаПоДоговору.Получить(0);
							    						СуммаДолга = 0;
							    						ДвДанныеДоговоров.ВсегоЗадолженность = СтрокаДолга.ВсегоЗадолженность - стрДолж.Сумма;
							    						Для каждого строкаОчередности Из Банк.ПорядокПогашенияЗадолженности Цикл
							    							Задолженность = строкаОчередности.Задолженность;
							    							СуммаЗадолженности = СтрокаДолга[строкаОчередности.Задолженность];
							    							СуммаПогашения = ?(СуммаЗадолженности <= ОстатокСуммы, СуммаЗадолженности, ОстатокСуммы);
							    							ДвижениеБД[Задолженность] = СуммаПогашения;
							    							ДвДанныеДоговоров[Задолженность] = СуммаЗадолженности - СуммаПогашения;
							    							ОстатокСуммы = ОстатокСуммы - СуммаПогашения;
							    						КонецЦикла;
							    						Если ОстатокСуммы > 0 Тогда
							    							Сообщить("У "+ стрДолж.Должник + " сумма платежа больше задолженности");
							    						КонецЕсли;
							    					Иначе
							    						ДвижениеБД.ПросроченныйОсновнойДолг = СуммаПлатежа;
							    					КонецЕсли;
							    					
												  Движения.ДанныеДоговоров.Записать(Ложь);//sza171128-1035 Широков_Игорь: списать долги по очереди
												  
												  

												  
							    				КонецЕсли;
							    				
							    				
							    				// регистр Платежи 
							    				РеестрДолжника = ПолучитьРеестрДолжника(ДатаПлатежа,стрДолж.Должник, стрДолж.Договор);
							    				
							    				Движение = Движения.Платежи.Добавить();
							    				ЗаполнитьЗначенияСвойств(Движение, стрДолж);
							    				
							    				Движение.Период 				= ДатаПлатежа;
							    				Движение.Ответственный 			= Сотрудник;
							    				Движение.Количество				= 1;
							    				//Движение.Вознаграждение 		= стрДолж.Сумма * ?(ПроцентВознаграждения = Null,0,ПроцентВознаграждения) / 100;
							    				//Движение.ПроцентВознаграждения 	= ПроцентВознаграждения;  
							    				Движение.Сотрудник 				= Сотрудник;
							    				Движение.Реестр 				= РеестрДолжника;// +Крылов 2011.03.05
							    				
												Движение.ОтметкаФССП=стрДолж.ОтметкаФССП;

							    							
							    	  
							    	   
							    	  
							    	  
							      КонецЦикла;
							  
							  КонецЕсли;
							  
							 
							  
				   Иначе			  

					  
					   
													         
									Для Каждого стрДолж Из ТаблицаДолжников Цикл
										
										
										
										
										
										Если стрДолж.ДатаПлатежа = '00010101' Тогда
											ДатаПлатежа	= Дата;
										Иначе
											ДатаПлатежа	= стрДолж.ДатаПлатежа;
										КонецЕсли; 
										Ответственный 	= Привязка.ПолучитьОтветственного(стрДолж.Должник, НачалоДня(ДатаПлатежа));
										Сотрудник 		= Привязка.ПолучитьСотрудникаАктивного(стрДолж.Должник, НачалоДня(ДатаПлатежа));
										
										//НайденнаяСтрока = тзПроцентыВознаграждения.Найти(стрДолж.НомерСтроки, "НомерСтроки");
										//Если НайденнаяСтрока = Неопределено Тогда
										//    Сообщить("Процент вознаграждения = 0. Реестром не загружены данные по договору: " + Строка(стрДолж.Договор), СтатусСообщения.Внимание);
										//	ПроцентВознаграждения = 0;
										//Иначе
										//    ПроцентВознаграждения = НайденнаяСтрока.ПроцентВознаграждения;
										//КонецЕсли;
										
										Банк = стрДолж.Договор.Банк;
										Если Банк.ПорядокПогашенияЗадолженности.Количество() > 0 Тогда
											// списывать задолженность только если указан порядок ее списания
											// регистр БалансДолжников Приход
											ДвижениеБД = Движения.БалансДолжников.Добавить();
											ДвижениеБД.ВидДвижения 	= ВидДвиженияНакопления.Расход;
											ДвижениеБД.Период 		= ДатаПлатежа;
											ДвижениеБД.Должник 		= стрДолж.Должник;
											ДвижениеБД.Договор 		= стрДолж.Договор;
											ДвижениеБД.Сумма		= стрДолж.Сумма;
											ДвижениеБД.Описание		= "Поступил платёж";
											
											
											ДвДанныеДоговоров = Движения.ДанныеДоговоров.Добавить();
											ДвДанныеДоговоров.Период 					= ДатаПлатежа;
											ДвДанныеДоговоров.ДатаРасчетаЗадолженности	= ДатаПлатежа;
											ДвДанныеДоговоров.Договор = стрДолж.Договор;
											ДвДанныеДоговоров.НомерСтрокиТаблицы = стрДолж.НомерСтроки;
											
											//sza171128-1035 Широков_Игорь: списать долги по очереди 
											СтруктураОтбора = Новый Структура("Договор", стрДолж.Договор);
											ТаблицаДолгаПоДоговору = РегистрыСведений.ДанныеДоговоров.СрезПоследних(ДатаПлатежа, СтруктураОтбора);
											СуммаПлатежа = стрДолж.Сумма;
											ОстатокСуммы = СуммаПлатежа;
											
											
											ТаблицаДолгаПоДоговору.Сортировать("Период УБЫВ,НомерСтрокиТаблицы УБЫВ");
											
										
											
											Если ТаблицаДолгаПоДоговору.Количество() > 0 Тогда // есть Структура долга 
												СтрокаДолга = ТаблицаДолгаПоДоговору.Получить(0);
												СуммаДолга = 0;
												ДвДанныеДоговоров.ВсегоЗадолженность = СтрокаДолга.ВсегоЗадолженность - стрДолж.Сумма;
												Для каждого строкаОчередности Из Банк.ПорядокПогашенияЗадолженности Цикл
													Задолженность = строкаОчередности.Задолженность;
													СуммаЗадолженности = СтрокаДолга[строкаОчередности.Задолженность];
													СуммаПогашения = ?(СуммаЗадолженности <= ОстатокСуммы, СуммаЗадолженности, ОстатокСуммы);
													ДвижениеБД[Задолженность] = СуммаПогашения;
													ДвДанныеДоговоров[Задолженность] = СуммаЗадолженности - СуммаПогашения;
													ОстатокСуммы = ОстатокСуммы - СуммаПогашения;
												КонецЦикла;
												Если ОстатокСуммы > 0 Тогда
													Сообщить("У "+ стрДолж.Должник + " сумма платежа больше задолженности");
												КонецЕсли;
											Иначе
												ДвижениеБД.ПросроченныйОсновнойДолг = СуммаПлатежа;
											КонецЕсли;
											Движения.ДанныеДоговоров.Записать(Ложь);//sza171128-1035 Широков_Игорь: списать долги по очереди
											

											
										КонецЕсли;
										
										
										// регистр Платежи 
										РеестрДолжника = ПолучитьРеестрДолжника(ДатаПлатежа,стрДолж.Должник, стрДолж.Договор);
										
										Движение = Движения.Платежи.Добавить();
										ЗаполнитьЗначенияСвойств(Движение, стрДолж);
										
										Движение.Период 				= ДатаПлатежа;
										Движение.Ответственный 			= Сотрудник;
										Движение.Количество				= 1;
										//Движение.Вознаграждение 		= стрДолж.Сумма * ?(ПроцентВознаграждения = Null,0,ПроцентВознаграждения) / 100;
										//Движение.ПроцентВознаграждения 	= ПроцентВознаграждения;  
										Движение.Сотрудник 				= Сотрудник;
										Движение.Реестр 				= РеестрДолжника;// +Крылов 2011.03.05
										Движение.ОтметкаФССП=стрДолж.ОтметкаФССП;
										
										
									КонецЦикла;
									
					   
				   
								КонецЕсли;
								
								
		 РегистрыСведений.ДанныеДоговоров.УстановитьИспользованиеИтогов(Истина);

	
	
КонецПроцедуры

Функция ПолучитьРеестрДолжника(ДатаПлатежа,Должник,Договор)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаПлатежа",ДатаПлатежа);
	Запрос.УстановитьПараметр("Должник",Должник);
	Запрос.УстановитьПараметр("Договор",Договор);
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	РеестрДолжники.Ссылка
	|ИЗ
	|	Документ.Реестр.Должники КАК РеестрДолжники
	|ГДЕ
	|	РеестрДолжники.Должник = &Должник
	|	И РеестрДолжники.Ссылка.Дата <= &ДатаПлатежа
	|	И РеестрДолжники.Договор = &Договор
	|
	|УПОРЯДОЧИТЬ ПО
	|	РеестрДолжники.Ссылка.Дата УБЫВ";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Документы.Реестр.ПустаяСсылка();
	
КонецФункции
